平常访问网址时可以看到有些奇怪的符号，它们对于后台程序来说意味着什么呢？一起来揭开它们的头盖骨吧。
第一位选手:问号哥（"?")
http://example.com/over/there?name=ferret
当服务器收到这样的请求时，它就知道客户端发送了一个name=ferret的查询语句，问号其实只是做个分割而已。下面有请问号哥的好基友，与号哥("&")。
第二位选手：与号哥（&），他是问号的好基友，经常我们可以看到他们两难舍难分，比如这样：
http://example.com/path/to/page?name=ferret&color=purple
看到这里他的作用你应该明白了，就是起到简单的连接，告诉服务器发送了两个字符串的查询请求。
那么他们一般会出现在哪里，怎么样才能在特定的地点把他们抓捕归案呢？据热心市民跟踪调查得出以下几个地方他们是经常出没的：

<form>…</form>
<img ismap> <img>
<isindex>
除了这些问号哥还可以进行用户跟踪，确保每个页面是同一个用户访问的，毕竟不同用户的访问页面是不同的，要是不小心发现隔壁阿花写的日记就不好了。

 <a href="foo.html?e0a72cb2a2c7">I am Mrs Flower!</a>
 <a href="bar.html?e0a72cb2a2c7">I am neighbor Wang</a>

最后一名选手：#号哥
他的作用是定位到html里的某个元素，仅仅是定位作用。